phase-4/02-strong-params-and-validations/app/controllers/citizens_controller.rb

  def index
    render json: Citizen.all
---
SELECT "citizens".* FROM "citizens"

  def create
    new_citizen = Citizen.create!(citizen_params)
---
INSERT INTO "citizens" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Sarah"], ["created_at", "2022-04-26 15:27:24.402878"], ["updated_at", "2022-04-26 15:27:24.402878"]]

  def find_citizen
    @citizen = Citizen.find(params[:id])
---
SELECT "citizens".* FROM "citizens" WHERE "citizens"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]