phase-4/02-strong-params-and-validations/app/controllers/countries_controller.rb

SELECT "countries".* FROM "countries"
---
  def index
    render json: Country.all

SELECT "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def find_country
    @country = Country.find(params[:id])