phase-4/02-strong-params-and-validations/app/controllers/passports_controller.rb

  def destroy
    # let's cause some DESTRUCTION
    @passport.destroy
---
DELETE FROM "passports" WHERE "passports"."id" = ?  [["id", 1]]

  def find_passport
    @passport = Passport.find(params[:id])
---
SELECT "passports".* FROM "passports" WHERE "passports"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]