phase-4/03-full-crud-and-resources/app/controllers/vacation_spots_controller.rb

  def index
      render json: VacationSpot.all
---
SELECT "vacation_spots".* FROM "vacation_spots"

  def create
    vs = VacationSpot.create!(vs_params)
---
INSERT INTO "vacation_spots" ("name", "weather", "hours_from_here", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Jamaica"], ["weather", "IT'S HOT"], ["hours_from_here", 3], ["created_at", "2022-04-27 15:00:20.979925"], ["updated_at", "2022-04-27 15:00:20.979925"]]

  def update
    @vacation_spot.update!(vs_params)
---
UPDATE "vacation_spots" SET "weather" = ?, "updated_at" = ? WHERE "vacation_spots"."id" = ?  [["weather", "cold"], ["updated_at", "2022-04-27 15:22:44.816245"], ["id", 3]]

  def find_vacation_spot
    @vacation_spot = VacationSpot.find(params[:id])
---
SELECT "vacation_spots".* FROM "vacation_spots" WHERE "vacation_spots"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]