phase-4/01-intro-to-rails/project-name/app/controllers/seasons_controller.rb

  def index
    render json: Season.all, only: :game, include: {hunters: {only: :name}}
---
SELECT "seasons".* FROM "seasons"