phase-4/04-serializers-and-nested-routes/app/controllers/vacations_controller.rb

  def find_person_vacations
    if params[:person_id]
      @all_vacations = Vacation.where(person_id: params[:person_id])
    else
      @all_vacations = Vacation.all
---
SELECT "vacations".* FROM "vacations" WHERE "vacations"."person_id" = ? AND "vacations"."id" = ? LIMIT ?  [["person_id", 4], ["id", 4], ["LIMIT", 1]]
SELECT "vacations".* FROM "vacations" WHERE "vacations"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]